tutorials/cases/charOnlyMoveCases/serial_m2/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     porousGasificationFoam;

startFrom       latestTime;

startTime       0; 

stopAt          endTime;

endTime         2.0;

deltaT          1e-7;

maxDeltaT	    0.0005;

writeControl    adjustableRunTime;

writeInterval   0.25;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep yes;

maxCo      1; 

maxDi      5000;

functions
{
//    #includeFunc  probes
//    #includeFunc  sample

    // Regression-test scalars (see applications/test/regression/).
    // The include is silent if the file is absent, so removing
    // regressionFunctions reverts the case to its original behaviour.
    #includeIfPresent "regressionFunctions"

    // ---- TUI-monitor support (probes panel + heatmap validation) ---- //

    // Probes at inlet/outlet sides, through the solid Z range, so the
    // monitor's probes panel has live data during the run.  Sampling only —
    // does not affect the solution or the regression baseline.
    probes
    {
        type            probes;
        libs            (sampling);
        enabled         true;
        writePrecision  10;
        writeControl    timeStep;
        writeInterval   1;
        fields          (Ts porosityF Ychar);
        probeLocations
        (
            (0.002 0 0.005)   // inlet-mid
            (0.018 0 0.005)   // outlet-mid
            (0.002 0 0.003)   // inlet-bot
            (0.018 0 0.003)   // outlet-bot
            (0.002 0 0.007)   // inlet-top
            (0.018 0 0.007)   // outlet-top
        );
    }
}

// ************************************************************************* //
